Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Returns true if the method containing the execution point represented by this stack trace element is a native method.
zh_cn: 如果包含由该堆栈跟踪元素所表示的执行点的方法是一个本机方法，则返回 true。

source: Returns true if the specified object is another StackTraceElement instance representing the same execution point as this instance.
zh_cn: 如果指定的对象是另一个 StackTraceElement 实例，并且该对象表示的执行点与该实例的相同，则返回 ture。

source: Returns true if the specified object is equal to this enum constant.
zh_cn: 当指定对象等于此枚举常量时，返回 true。

source: Returns true if the specified object represents an annotation that is logically equivalent to this one.
zh_cn: 如果指定的对象表示在逻辑上等效于此接口的注释，则返回 true。

source: Returns true if this Class object represents an annotation type.
zh_cn: 如果此 Class 对象表示一个注释类型则返回 true。

source: Returns true if this executor is in the process of terminating after shutdown() or shutdownNow() but has not completely terminated.
zh_cn: 如果此执行程序处于在 shutdown() 或 shutdownNow() 之后正在终止但尚未完全终止的过程中，则返回 true。

source: Returns true if this pool allows core threads to time out and terminate if no tasks arrive within the keepAlive time, being replaced if needed when new tasks arrive.
zh_cn: 如果此池允许核心线程超时和终止，如果在 keepAlive 时间内没有任务到达，新任务到达时正在替换（如果需要），则返回 true。

source: Returns value of this Float as a long (by casting to type long).
zh_cn: 将此 Float 值以 long 形式返回（强制转换为 long 类型）。

source: Returns x's Class if it is of the form "class C implements Comparable", else null.
zh_cn: 如果 x 的形式是 "class C implements Comparable"，则返回 x 的 Class，否则返回 null。

source: Returns zero if the specified value has no one-bits in its two's complement binary representation, that is, if it is equal to zero.
zh_cn: 如果指定值在其二进制补码表示形式中没有 1 位，即等于零，则返回零。

source: Runs the finalization methods of any objects pending finalization.
zh_cn: 运行处于挂起终止状态的所有对象的终止方法。

source: Runs the garbage collector.
zh_cn: 运行垃圾回收器。

source: Sample code might look like:
zh_cn: 示例代码如下所示：

source: Save the state of the HashMap instance to a stream (i.e., serialize it).
zh_cn: 将 HashMap 实例的状态保存到流(即序列化它)。

source: See TypeVariable for details on the creation process for type variables.
zh_cn: 有关类型变量创建过程的详细信息，请参阅 TypeVariable。

source: See stop() for details.
zh_cn: 有关详细信息，请参见 stop()。

source: See clone() for details on overriding this method.
zh_cn: 请参阅 clone()，以获得有关重写此方法的详细信息。

source: See Section 15.8.2 of The Java™ Language Specification.
zh_cn: 请参阅 The Java™ Language Specification 的第 15.8.2 节。

source: See also the java.util.concurrent.locks and java.util.concurrent.atomic packages.
zh_cn: 另请参阅 java.util.concurrent.locks 和 java.util.concurrent.atomic 包。

source: See also:
zh_cn: 另请参阅：

source: See below for hook methods defined to be invoked upon insertion, removal and access that allow LinkedHashMap internals to otherwise remain independent of these mechanics.
zh_cn: 请参阅下面的钩子方法，这些钩子方法被定义为在插入，移除和访问时被调用，以允许 LinkedHashMap 内部部件保持独立于这些机制。

source: See the notify method for a description of the ways in which a thread can become the owner of a monitor.
zh_cn: 有关线程能够成为监视器所有者的方法的描述，请参阅 notify 方法。

source: See the declaration of ParameterizedType for the semantics of the creation process for parameterized types and see TypeVariable for the creation process for type variables.
zh_cn: 请参见 ParameterizedType 的声明获得参数化类型创建过程的语义，参见 TypeVariable 获得创建类型变量的过程。

source: Selects the proxy server to use, if any, when connecting to the network resource referenced by a URL.
zh_cn: 连接到 URL 引用的网络资源时选择要使用的代理服务器（如果有）。

source: Sending and receiving with TCP sockets is done through InputStreams and OutputStreams which can be obtained via the getInputStream() and getOutputStream() methods.
zh_cn: 使用 TCP 套接字的发送和接收操作需要借助 InputStream 和 OutputStream 来完成，这两者是通过 Socket.getInputStream() 和 Socket.getOutputStream() 方法获取的。

source: Serializability of a class is enabled by the class implementing the java.io.Serializable interface.
zh_cn: 类通过实现 java.io.Serializable 接口以启用其序列化功能。

source: Serialization's descriptor for classes.
zh_cn: 类的序列化描述符。

source: Set the accessible flag for this object to the indicated boolean value.
zh_cn: 将此对象的 accessible 标志设置为指示的布尔值。

source: Set the default handler invoked when a thread abruptly terminates due to an uncaught exception, and no other handler has been defined for that thread.
zh_cn: 设置当线程由于未捕获到异常而突然终止，并且没有为该线程定义其他处理程序时所调用的默认处理程序。

source: Set the handler invoked when this thread abruptly terminates due to an uncaught exception.
zh_cn: 设置该线程由于未捕获到异常而突然终止时调用的处理程序。

source: Sets a new handler for unexecutable tasks.
zh_cn: 设置用于未执行任务的新处理程序。

source: Sets the context ClassLoader for this Thread.
zh_cn: 设置该线程的上下文 ClassLoader。

source: Sets the core number of threads.
zh_cn: 设置核心线程数。

source: Sets the current thread's copy of this thread-local variable to the specified value.
zh_cn: 将此线程局部变量的当前线程副本中的值设置为指定值。

source: Sets the default assertion status for this class loader to false and discards any package defaults or class assertion status settings associated with the class loader.
zh_cn: 将此类加载器的默认断言状态设置为 false，并放弃与此类加载器关联的所有默认包或类断言状态设置。

source: Sets the default assertion status for this class loader.
zh_cn: 设置此类加载器的默认断言状态。

source: Sets the desired assertion status for the named top-level class in this class loader and any nested classes contained therein.
zh_cn: 设置在此类加载器及其包含的嵌套类中指定的最高层类所需的断言状态。

source: Sets the field represented by this Field object on the specified object argument to the specified new value.
zh_cn: 将指定对象变量上此 Field 对象表示的字段设置为指定的新值。

source: Sets the length of the character sequence.
zh_cn: 设置字符序列的长度。

source: Sets the maximum allowed number of threads.
zh_cn: 设置允许的最大线程数。

source: Sets the maximum priority of the group.
zh_cn: 设置线程组的最高优先级。

source: Sets the package default assertion status for the named package.
zh_cn: 为指定包设置默认断言状态。

source: Sets the policy governing whether core threads may time out and terminate if no tasks arrive within the keep-alive time, being replaced if needed when new tasks arrive.
zh_cn: 如果在保持活动时间内没有任务到达，新任务到达时正在替换（如果需要），则设置控制核心线程是超时还是终止的策略。

source: Sets the signers of a class.
zh_cn: 设置类的签署者。

source: Sets the stack trace elements that will be returned by getStackTrace() and printed by printStackTrace() and related methods.
zh_cn: 设置将由 getStackTrace() 返回，并由 printStackTrace() 和相关方法输出的堆栈跟踪元素。

source: Sets the system property indicated by the specified key.
zh_cn: 设置指定键指示的系统属性。

source: Sets the thread factory used to create new threads.
zh_cn: 设置用于创建新线程的线程工厂。

source: Sets the thread keep-alive time, which is the amount of time that threads may remain idle before being terminated.
zh_cn: 设置线程保持活动时间，即线程在终止之前可能保持空闲的时间量。

source: Sets the value of a field as a boolean on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 boolean 值。

source: Sets the value of a field as a byte on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 byte 值。

source: Sets the value of a field as a char on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 char 值。

source: Sets the value of a field as a double on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 double 值。

source: Sets the value of a field as a float on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 float 值。

source: Sets the value of a field as a long on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 long 值。

source: Sets the value of a field as a short on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 short 值。

source: Sets the value of a field as an int on the specified object.
zh_cn: 将字段的值设置为指定对象上的一个 int 值。

source: Sets the value of the indexed component of the specified array object to the specified boolean value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 boolean 值。

source: Sets the value of the indexed component of the specified array object to the specified byte value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 byte 值。

source: Sets the value of the indexed component of the specified array object to the specified char value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 char 值。

source: Sets the value of the indexed component of the specified array object to the specified double value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 double 值。

source: Sets the value of the indexed component of the specified array object to the specified float value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 float 值。

source: Sets the value of the indexed component of the specified array object to the specified int value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 int 值。

source: Sets the value of the indexed component of the specified array object to the specified long value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 long 值。

source: Sets the value of the indexed component of the specified array object to the specified short value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的 short 值。

source: Sets the value of the indexed component of the specified array object to the specified new value.
zh_cn: 将指定数组对象中索引组件的值设置为指定的新值。

source: Sets this process builder's redirectErrorStream property.
zh_cn: 设置此进程生成器的 redirectErrorStream 属性。

source: Sets this process builder's operating system program and arguments.
zh_cn: 设置此进程生成器的操作系统程序和参数。

source: Sets this process builder's working directory.
zh_cn: 设置此进程生成器的工作目录。

source: Setting the accessible flag in a reflected object permits sophisticated applications with sufficient privilege, such as Java Object Serialization or other persistence mechanisms, to manipulate objects in a manner that would normally be prohibited.
zh_cn: 在反射对象中设置 accessible 标志允许具有足够特权的复杂应用程序（比如 Java Object Serialization 或其他持久性机制）以某种通常禁止使用的方式来操作对象。

source: Should be at least 4 * TREEIFY_THRESHOLD to avoid conflicts between resizing and treeification thresholds.
zh_cn: 应该至少为 4 * TREEIFY_THRESHOLD 以避免调整大小和树化阈值之间的冲突。

source: Should be less than TREEIFY_THRESHOLD, and at most 6 to mesh with shrinkage detection under removal.
zh_cn: 应该小于 TREEIFY_THRESHOLD ，并且最大为6，以吻合移除期间的收缩检测。

source: Signals that a malformed string in modified UTF-8 format has been read in a data input stream or by any class that implements the data input interface.
zh_cn: 在数据输入流中或由实现该数据输入接口的任何类中以 modified UTF-8 格式读取错误字符串时，抛出此异常。

source: Signals that a method has been invoked at an illegal or inappropriate time.
zh_cn: 在非法或不适当的时间调用方法时产生的信号。

source: Signals that a resource is missing.
zh_cn: 缺少资源时抛出此异常。

source: Signals that a sync operation has failed.
zh_cn: 当 sync 操作失败时，抛出此异常。

source: Signals that a timeout has occurred on a socket read or accept.
zh_cn: 如果在读取或接受套接字时发生超时，则抛出此异常。

source: Signals that an I/O exception of some sort has occurred.
zh_cn: 当发生某种 I/O 异常时，抛出此异常。

source: Signals that an I/O operation has been interrupted.
zh_cn: I/O 操作已中断信号，抛出此异常。

source: Signals that an ICMP Port Unreachable message has been received on a connected datagram.
zh_cn: 在连接的数据报上已接收到 ICMP Port Unreachable 消息时，抛出该异常。

source: Signals that an attempt to open the file denoted by a specified pathname has failed.
zh_cn: 当试图打开指定路径名表示的文件失败时，抛出此异常。

source: Signals that an end of file or end of stream has been reached unexpectedly during input.
zh_cn: 当输入过程中意外到达文件或流的末尾时，抛出此异常。

source: Signals that an error has been reached unexpectedly while parsing.
zh_cn: 表示解析时出现意外错误。

source: Signals that an error occurred while attempting to bind a socket to a local address and port.
zh_cn: 试图将套接字绑定到本地地址和端口时发生错误的情况下，抛出此异常。

source: Signals that an error occurred while attempting to connect a socket to a remote address and port.
zh_cn: 试图将套接字连接到远程地址和端口时发生错误的情况下，抛出此异常。

source: Signals that an unexpected exception has occurred in a static initializer.
zh_cn: 静态初始化程序中发生意外异常的信号。

source: Signals that one of the ObjectStreamExceptions was thrown during a write operation.
zh_cn: 在写入操作过程中抛出 ObjectStreamException 之一的信号。

source: Signals that the class doesn't have a field of a specified name.
zh_cn: 类不包含指定名称的字段时产生的信号。

source: SignedObject is a class for the purpose of creating authentic runtime objects whose integrity cannot be compromised without being detected.
zh_cn: SignedObject 是一个用来创建实际运行时对象的类，在检测不到这些对象的情况下，其完整性不会遭受损害。

source: Similarly for Callables submitted to an ExecutorService.
zh_cn: 同样适用于向 ExecutorService 提交 Callables。

source: Similarly, attempting to read an enum-valued member will result in a EnumConstantNotPresentException if the enum constant in the annotation is no longer present in the enum type.
zh_cn: 类似地，如果注释中的枚举常量不再以枚举类型存在，那么试图读取一个已赋值的枚举成员将导致一个 EnumConstantNotPresentException。

source: Similarly, only this class or one of its subclasses can be the argument type in a catch clause.
zh_cn: 类似地，只有此类或其子类之一才可以是 catch 子句中的参数类型。

source: Since a proxy class implements all of the interfaces specified at its creation, invoking getInterfaces on its Class object will return an array containing the same list of interfaces (in the order specified at its creation), invoking getMethods on its Class object will return an array of Method objects that include all of the methods in those interfaces, and invoking getMethod will find methods in the proxy interfaces as would be expected.
zh_cn: 由于代理类将实现所有在其创建时指定的接口，所以对其 Class 对象调用 getInterfaces 将返回一个包含相同接口列表的数组（按其创建时指定的顺序），对其 Class 对象调用 getMethods 将返回一个包括这些接口中所有方法的 Method 对象的数组，并且调用 getMethod 将会在代理接口中找到期望的一些方法。

source: Since the external format of environment variable names and values is system-dependent, there may not be a one-to-one mapping between them and Java's Unicode strings.
zh_cn: 由于环境变量名和值的外部格式取决于系统，在它们与 Java 的 Unicode 字符串之间不可能是一对一映射。

source: Since this interface may be implemented by existing classes with different styles of error handling there is no guarantee that errors will be propagated to the invoker.
zh_cn: 由于此接口可能由具有不同的错误处理风格的现有类实现，所以无法保证错误不会传播给调用者。

source: Size the table using given load factor only if within
zh_cn: 设置表的大小，仅当在给定的加载因子在

source: So instead we swap the tree linkages.
zh_cn: 所以相反，我们交换树链接。

source: So we apply a transform that spreads the impact of higher bits downward.
zh_cn: 所以我们应用一个转换，将高位的影响向下扩展。

source: So, while it is possible to create an URI with any kind of protocol scheme (e.g. myproto://myhost.mydomain/resource/), a similar URL will try to instantiate the handler for the specified protocol; if it doesn't exist an exception will be thrown.
zh_cn: 因此，尽管可能利用任何种类的协议方案（例如，myproto://myhost.mydomain/resource/）创建 URI，但类似的 URL 仍将试图实例化指定协议的处理程序；如果指定协议的处理程序不存在，则抛出异常。

source: Sockets
zh_cn: 套接字

source: Sockets are means to establish a communication link between machines over the network.
zh_cn: 套接字是在网络上建立机器之间的通信链接的方法。

source: Soft and weak references are automatically cleared by the collector before being added to the queues with which they are registered, if any.
zh_cn: 在将软引用和弱引用添加到向其注册的队列（如果有）之前，回收器将自动清除这些引用。

source: Soft reference objects, which are cleared at the discretion of the garbage collector in response to memory demand.
zh_cn: 软引用对象，在响应内存需要时，由垃圾回收器决定是否清除此对象。

source: Soft references are for implementing memory-sensitive caches, weak references are for implementing canonicalizing mappings that do not prevent their keys (or values) from being reclaimed, and phantom references are for scheduling pre-mortem cleanup actions in a more flexible way than is possible with the Java finalization mechanism.
zh_cn: 软引用适用于实现内存敏感的缓存，弱引用适用于实现无法防止其键（或值）被回收的规范化映射，而虚引用则适用于以某种比 Java 终结机制更灵活的方式调度 pre-mortem 清除操作。

source: Sole constructor.
zh_cn: 单独的构造方法。

source: Some implementations may use null to represent the bootstrap class loader.
zh_cn: 有些实现可能使用 null 来表示引导类加载器。

source: Some other thread interrupts thread T.
zh_cn: 其他某个线程中断线程 T。

source: Some other thread invokes the notify method for this object and thread T happens to be arbitrarily chosen as the thread to be awakened.
zh_cn: 其他某个线程调用此对象的 notify 方法，并且线程 T 碰巧被任选为被唤醒的线程。

source: Some other thread invokes the notifyAll method for this object.
zh_cn: 其他某个线程调用此对象的 notifyAll 方法。

source: Some time after the garbage collector determines that the reachability of the referent has changed to the value corresponding to the type of the reference, it will add the reference to the associated queue.
zh_cn: 在垃圾回收器确定引用的可到达性已经更改为对应于引用类型的值之后的某一时间，它会将引用添加到相关的队列中。

source: Some virtual machines may, under some circumstances, omit one or more stack frames from the stack trace.
zh_cn: 某些虚拟机在某些情况下可能会从堆栈跟踪中省略一个或多个堆栈帧。

source: Specification version numbers use a syntax that consists of nonnegative decimal integers separated by periods ".", for example "2.0" or "1.2.3.4.5.6.7".
zh_cn: 规范的版本号使用了一个由句点 "." 分隔的十进制正整数组成的语法，例如 "2.0" 或 "1.2.3.4.5.6.7"。

source: Specifies the rounding behavior for operations whose results cannot be represented exactly.
zh_cn: 指定其结果不能精确表示的操作的舍入行为。

source: Splits nodes in a tree bin into lower and upper tree bins, or untreeifies if now too small.
zh_cn: 将树形结构中的节点拆分为较低和较高的树形结构，或者如果现在太小，则将结果拆分。

source: Splits this string around matches of the given regular expression.
zh_cn: 根据匹配给定的正则表达式来拆分此字符串。

source: Standardized representation for serialized Key objects.
zh_cn: 已序列化的 Key 对象的标准表示形式。

source: Starting a new process which uses the default working directory and environment is easy:
zh_cn: 很容易启动一个使用默认工作目录和环境的新进程：

source: Starting an operating system process is highly system-dependent.
zh_cn: 启动操作系统进程的方式完全取决于系统。

source: Starts a core thread, causing it to idly wait for work.
zh_cn: 启动核心线程，使其处于等待工作的空闲状态。

source: Starts a new process using the attributes of this process builder.
zh_cn: 使用此进程生成器的属性启动一个新进程。

source: Starts all core threads, causing them to idly wait for work.
zh_cn: 启动所有核心线程，使其处于等待工作的空闲状态。

source: Static classes and methods for operating on or creating instances of Spliterator and its primitive specializations Spliterator.OfInt, Spliterator.OfLong, and Spliterator.OfDouble.
zh_cn: 用于操作或创建 Spliterator 实例的静态类和方法，以及它的基本类型用的 Spliterator.OfInt、Spliterator.OfLong 和 Spliterator.OfDouble。

source: Stopping a thread with Thread.stop causes it to unlock all of the monitors that it has locked (as a natural consequence of the unchecked ThreadDeath exception propagating up the stack).
zh_cn: 使用 Thread.stop 停止线程会导致它解锁它锁定的所有监视器(这是非检查型 ThreadDeath 异常向上传播的自然结果)。

source: String buffers are safe for use by multiple threads.
zh_cn: 可将字符串缓冲区安全地用于多个线程。

source: String buffers support mutable strings.
zh_cn: 字符串缓冲区支持可变的字符串。

source: String concatenation is implemented through the StringBuilder(or StringBuffer) class and its append method.
zh_cn: 字符串串联是通过 StringBuilder（或 StringBuffer）类及其 append 方法实现的。

source: String conversions are implemented through the method toString, defined by Object and inherited by all classes in Java.
zh_cn: 字符串转换是通过 toString 方法实现的，该方法由 Object 类定义，并可被 Java 中的所有类继承。

source: Strings are constant; their values cannot be changed after they are created.
zh_cn: 字符串是常量；它们的值在创建之后不能更改。

source: Strong bidirectional character type "AL" in the Unicode specification.
zh_cn: Unicode 规范中的强双向字符类型“AL”。

source: Strong bidirectional character type "L" in the Unicode specification.
zh_cn: Unicode 规范中的强双向字符类型“L”。

source: Strong bidirectional character type "LRE" in the Unicode specification.
zh_cn: Unicode 规范中的强双向字符类型“LRE”。

source: Strong bidirectional character type "LRO" in the Unicode specification.
zh_cn: Unicode 规范中的强双向字符类型“LRO”。

source: Strong bidirectional character type "R" in the Unicode specification.
zh_cn: Unicode 规范中的强双向字符类型“R”。

source: Strong bidirectional character type "RLE" in the Unicode specification.
zh_cn: Unicode 规范中的强双向字符类型“RLE”。

source: Strong bidirectional character type "RLO" in the Unicode specification.
zh_cn: Unicode 规范中的强双向字符类型“RLO”。

source: Subclasses of LinkageError indicate that a class has some dependency on another class; however, the latter class has incompatibly changed after the compilation of the former class.
zh_cn: LinkageError 的子类指示一个类在一定程度上依赖于另一个类；但是，在编译前一个类之后，后一个类发生了不相容的改变。

source: Subclasses of Number must provide methods to convert the represented numeric value to byte, double, float, int, long, and short.
zh_cn: Number 的子类必须提供将表示的数值转换为 byte、double、float、int、long 和 short 的方法。

source: Subclasses of Thread should override this method.
zh_cn: Thread 的子类应该重写该方法。

source: Subclasses of Object may override this definition.
zh_cn: Object 的子类可以重写此定义。

source: Subclasses of Throwable represent errors and exceptions.
zh_cn: Throwable 的子类表示错误和异常。

source: Submits a Runnable task for execution and returns a Future representing that task.
zh_cn: 提交一个 Runnable 任务用于执行，并返回一个表示该任务的 Future。

source: Submits a value-returning task for execution and returns a Future representing the pending results of the task.
zh_cn: 提交一个返回值的任务用于执行，返回一个表示任务的未决结果的 Future。

source: Subprocesses subsequently started by this object's start() method will use this as their working directory.
zh_cn: 由此对象的 start() 方法启动的后续子进程将使用此目录作为它们的工作目录。

source: Subprocesses subsequently started by this object's start() method will use this map as their environment.
zh_cn: 由此对象的 start() 方法启动的后续子进程将使用这一映射作为它们的环境。

source: Subsequent changes to this sequence do not affect the contents of the String.
zh_cn: 对此序列的后续更改不影响该 String 的内容。

source: Subsequent modifications to this process builder will not affect the returned Process.
zh_cn: 针对此进程生成器的后续修改将不会影响返回的 Process。

source: Subsequent updates to the list will be reflected in the state of the process builder.
zh_cn: 后续列表更新将在进程生成器的状态中反映出来。

source: Subsequent updates to the list will be reflected in the state of this process builder.
zh_cn: 后续列表更新将在此进程生成器的状态中反映出来。

source: Such deadlocks typically manifest themselves as "frozen" processes.
zh_cn: 这类死锁通常会证明它们自己是“冻结”的进程。

source: Such higher-performance implementations still must conform to the specification for Math.
zh_cn: 这种更高性能的实现仍然必须遵守 Math 的规范。

source: Superclass of all exceptions specific to Object Stream classes.
zh_cn: 特定于 Object Stream 类的所有异常的超类。

source: Suppose that the garbage collector determines at a certain point in time that an object is softly reachable.
zh_cn: 假定垃圾回收器确定在某一时间点某个对象是软可到达对象。

source: Suppose that the garbage collector determines at a certain point in time that an object is weakly reachable.
zh_cn: 假定垃圾回收器确定在某一时间点上某个对象是弱可到达对象。

source: Suppose the internals of the add method can throw an IOException.
zh_cn: 假定 add 方法的内部可以抛出 IOException。

source: Synchronizers
zh_cn: 同步器

source: Taking the length of null as if it were an array.
zh_cn: 将 null 作为一个数组，获得其长度。

source: Tells whether or not this reference object has been enqueued, either by the program or by the garbage collector.
zh_cn: 由程序或垃圾回收器通知是否已将此引用对象加入队列。

source: Tells whether or not this string matches the given regular expression.
zh_cn: 告知此字符串是否匹配给定的正则表达式。

source: Tells whether this process builder merges standard error and standard output.
zh_cn: 通知进程生成器是否合并标准错误和标准输出。

source: Terminates the currently running Java Virtual Machine.
zh_cn: 终止当前正在运行的 Java 虚拟机。

source: Terminates the currently running Java virtual machine by initiating its shutdown sequence.
zh_cn: 通过启动虚拟机的关闭序列，终止当前正在运行的 Java 虚拟机。

source: Tests if the substring of this string beginning at the specified index starts with the specified prefix.
zh_cn: 测试此字符串从指定索引开始的子字符串是否以指定前缀开始。

source: Tests if this string ends with the specified suffix.
zh_cn: 测试此字符串是否以指定的后缀结束。

source: Tests if this string starts with the specified prefix.
zh_cn: 测试此字符串是否以指定的前缀开始。

source: Tests if this thread group has been destroyed.
zh_cn: 测试此线程组是否已经被销毁。

source: Tests if this thread group is a daemon thread group.
zh_cn: 测试此线程组是否为一个后台程序线程组。

source: Tests if this thread group is either the thread group argument or one of its ancestor thread groups.
zh_cn: 测试此线程组是否为线程组参数或其祖先线程组之一。

source: Tests if this thread is a daemon thread.
zh_cn: 测试该线程是否为守护线程。

source: Tests if this thread is alive.
zh_cn: 测试线程是否处于活动状态。

source: Tests if two string regions are equal.
zh_cn: 测试两个字符串区域是否相等。

source: Tests whether the current thread has been interrupted.
zh_cn: 测试当前线程是否已经中断。

source: Tests whether this thread has been interrupted.
zh_cn: 测试线程是否已经中断。

source: That class then implements the run method.
zh_cn: 该类然后实现 run 方法。

source: That is, Error and its subclasses are regarded as unchecked exceptions for the purposes of compile-time checking of exceptions.
zh_cn: 即，Error 和它的子类被认为是用于编译时异常的检查目的非检查型异常。
